# Taps
tap "FelixKratz/formulae" # borders
tap "buo/cask-upgrade" # cask upgrade tool, used by topgrade
tap "nikitabobko/tap" # aerospace

# Brews
brew "atuin"
brew "azure-cli"
brew "bacon"
brew "bash"
brew "bkt"
brew "borders"
brew "bottom"
brew "chezmoi"
brew "coreutils"
brew "curlie"
brew "difftastic"
brew "direnv"
brew "duckdb"
brew "exiftool"
brew "eza"
brew "fd"
brew "fennel"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "helix"
brew "hyperfine"
brew "jj"
brew "jq"
brew "just"
brew "lazygit"
brew "luajit"
brew "luarocks"
brew "mergiraf"
brew "mise"
brew "mkcert"
brew "moar"
brew "neovim"
brew "nss"
brew "nushell"
brew "oh-my-posh"
brew "ouch"
brew "riff"
brew "ripgrep"
brew "rm-improved"
brew "sd"
brew "tealdeer"
brew "topgrade"
brew "uv"
brew "watchexec"
brew "wget"
brew "zoxide"

# Casks
cask "1password"
cask "aerospace"
cask "audacity"
cask "beeper"
cask "betterdisplay"
cask "bluesnooze"
cask "calibre"
cask "claude-code"
cask "dotnet-sdk"
cask "elgato-wave-link"
cask "espanso"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "gog-galaxy"
cask "hammerspoon"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "keymapp"
cask "linearmouse"
cask "logseq"
cask "maccy"
cask "microsoft-teams"
cask "notion"
cask "pocket-casts"
cask "podman-desktop"
cask "qobuz"
cask "rancher"
cask "raycast"
cask "rider"
cask "shortcat"
cask "signal"
cask "spotify"
cask "steam"
cask "super-productivity"
cask "syncthing-app"
cask "todoist-app"
cask "visual-studio-code"
cask "wezterm"
