# Taps
tap "FelixKratz/formulae" # borders
tap "abhinav/tap" # git-spice
tap "buo/cask-upgrade" # cask upgrade tool, used by topgrade
tap "homebrew/bundle" # brew bundle
tap "homebrew/services"
tap "nikitabobko/tap" # aerospace

# Brews
brew "atuin"
brew "azure-cli"
brew "bacon"
brew "bash"
brew "bkt"
brew "borders"
brew "bottom"
brew "chezmoi"
brew "coreutils"
brew "difftastic"
brew "duckdb"
brew "exiftool"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-spice"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "helix"
brew "hyperfine"
brew "jj"
brew "jq"
brew "just"
brew "lazygit"
brew "luajit"
brew "luarocks"
brew "mise"
brew "mkcert"
brew "moar"
brew "neovim"
brew "node"
brew "nss"
brew "nushell"
brew "oh-my-posh"
brew "ouch"
brew "python"
brew "riff"
brew "ripgrep"
brew "rm-improved"
brew "sd"
brew "starship"
brew "tealdeer"
brew "topgrade"
brew "typescript"
brew "typescript"
brew "uv"
brew "wget"
brew "zoxide"

# Casks
cask "1password"
cask "aerospace"
cask "audacity"
cask "bartender"
cask "beeper"
cask "betterdisplay"
cask "bluesnooze"
cask "elgato-wave-link"
cask "espanso"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "hammerspoon"
cask "karabiner-elements"
cask "keymapp"
cask "languagetool"
cask "linearmouse"
cask "logseq"
cask "maccy"
cask "meetingbar"
cask "pocket-casts"
cask "proton-drive"
cask "raycast"
cask "rider"
cask "shortcat"
cask "signal"
cask "spotify"
cask "steam"
cask "swiftbar"
cask "syncthing"
cask "tidal"
cask "todoist"
cask "wezterm"
